
s = 'code-basics'

# Как получить подстроку (каким термином её ещё называют) 'sic'?
str1 = s[7:10] 
# Как получить от первого символа до 3?
str2 = s[:3] 
# Как получить от 4 до последнего?
str3 = s[4:] 
# С помощью каких ещё значений в этой операции можно получить подстроку 'sic'?
str4 = s[-4:-1] 
# Какое ещё можно указать значение в операции получения подстроки, 
# так что бы получить подстроку 'oebs' (пропущен каждый второй символ), как это работает по шагам?
str5 = s[1:8:2] 
# Какя ещё поддерживается возможность позволяющая к примеру быстро перевернуть строку?
str6 = s[::-1]
# Как с её помощью получить подстроку 'cisab'?
str7 = s[9:4:-1]